#자료형- 변수: 값을 저장하는 공간
#숫자(정수,실수), 문자열, 불(True,False)
#문자열과 숫자는 더하기를 할 수 없다.

# print("합계: "+100), 불가능/에러남
# print("합계:",100) #쉼표를 쓰면 한칸 띄어쓰기가 된다.
# print(1000,200,300,400,500)
# print("합계:",100,True) #다른 타입도 출력가능

##Ctrl+/ 하면 주석처리 가능..

#숫자를 입력해서 출력하시오.
num= input("숫자를 입력하시오.") #input타입: 문자열
print(num) #100을 입력했을 때, 여기서 100은 문자열 타입이다. input타입이므로
print("숫자1:",int(num)) #문자열->정수타입으로 변경 int/실수타입으로 변경 float
num2= input("숫자를 입력하세요.")
print("숫자2:",int(num))
#print("숫자2:"+num) 문자열과 문자열 더하기는 가능하다. 문자열과 숫자는 불가능

##반복문과 조건문의 등장



